generated/resources/wsdl/BookService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="BookService" targetNamespace="http://service.approach.up.bottom.series.jaxws.com/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://service.approach.up.bottom.series.jaxws.com/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
<schema xmlns="http://www.w3.org/2001/XMLSchema">
  <import namespace="http://service.approach.up.bottom.series.jaxws.com/" schemaLocation="BookService_schema1.xsd"/>
</schema>
  </wsdl:types>
  <wsdl:message name="getBookNameBasedOnISBN">
    <wsdl:part name="parameters" element="tns:getBookNameBasedOnISBN">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getBookNameBasedOnISBNResponse">
    <wsdl:part name="parameters" element="tns:getBookNameBasedOnISBNResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="BookService">
    <wsdl:operation name="getBookNameBasedOnISBN">
      <wsdl:input name="getBookNameBasedOnISBN" message="tns:getBookNameBasedOnISBN">
    </wsdl:input>
      <wsdl:output name="getBookNameBasedOnISBNResponse" message="tns:getBookNameBasedOnISBNResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BookServiceSoapBinding" type="tns:BookService">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getBookNameBasedOnISBN">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="getBookNameBasedOnISBN">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getBookNameBasedOnISBNResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="BookService">
    <wsdl:port name="BookServiceImplPort" binding="tns:BookServiceSoapBinding">
      <soap:address location="http://localhost:8080/ApacheCXF-JAX-WS-Bottom-Up/services/BookService"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
